Terraform plan for __dev__
<details>
<summary>Plan: 34 to add, 0 to change, 10 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.inventory_events.google_pubsub_subscription.pull_subscriptions["inventory-management-view"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-management-view"
      + project                    = "ebo-dev-321910"
      + topic                      = "inventory-management"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription_iam_member.pull_subscription_binding["inventory-management-view"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-management-view"
    }

  # module.order-notification-grn.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "***********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-dev" -> (known after apply)
      ~ number              = "548192617349" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-grn.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYoNac4Q=" -> (known after apply)
      ~ id      = "*****************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-grn.google_pubsub_subscription.push_subscriptions["order-notification-grn-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-grn-push"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-grn"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-dev-321910/topics/order-notification-grn-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-dev.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-grn.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-grn-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-grn-push"
    }

  # module.order-notification-grn.google_pubsub_topic_iam_member.push_topic_binding["order-notification-grn-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW89JN7JQ=" -> (known after apply)
      ~ id      = "*********************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-grn-dl.google_pubsub_subscription.pull_subscriptions["order-notification-grn-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-grn-dl-error"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-grn-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-grn-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-grn-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-grn-dl-error"
    }

  # module.order-notification-ian.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "***********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-dev" -> (known after apply)
      ~ number              = "548192617349" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-ian.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYoNac4Q=" -> (known after apply)
      ~ id      = "*****************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-ian.google_pubsub_subscription.push_subscriptions["order-notification-ian-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ian-push"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-ian"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-dev-321910/topics/order-notification-ian-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-dev.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-ian.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-ian-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ian-push"
    }

  # module.order-notification-ian.google_pubsub_topic_iam_member.push_topic_binding["order-notification-ian-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW9J8WgUk=" -> (known after apply)
      ~ id      = "*********************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-ian-dl.google_pubsub_subscription.pull_subscriptions["order-notification-ian-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ian-dl-error"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-ian-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-ian-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-ian-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ian-dl-error"
    }

  # module.order-notification-pick.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "***********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-dev" -> (known after apply)
      ~ number              = "548192617349" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-pick.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYoNac4Q=" -> (known after apply)
      ~ id      = "*****************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-pick.google_pubsub_subscription.push_subscriptions["order-notification-pick-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-pick-push"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-pick"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-dev-321910/topics/order-notification-pick-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-dev.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-pick.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-pick-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-pick-push"
    }

  # module.order-notification-pick.google_pubsub_topic_iam_member.push_topic_binding["order-notification-pick-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW9J8a9JM=" -> (known after apply)
      ~ id      = "**********************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-pick-dl.google_pubsub_subscription.pull_subscriptions["order-notification-pick-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-pick-dl-error"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-pick-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-pick-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-pick-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-pick-dl-error"
    }

  # module.order-notification-ship.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "***********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-dev" -> (known after apply)
      ~ number              = "548192617349" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-ship.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYoNac4Q=" -> (known after apply)
      ~ id      = "*****************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-ship.google_pubsub_subscription.push_subscriptions["order-notification-ship-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ship-push"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-ship"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-dev-321910/topics/order-notification-ship-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-dev.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-ship.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-ship-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ship-push"
    }

  # module.order-notification-ship.google_pubsub_topic_iam_member.push_topic_binding["order-notification-ship-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW9J9itMw=" -> (known after apply)
      ~ id      = "**********************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-ship-dl.google_pubsub_subscription.pull_subscriptions["order-notification-ship-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ship-dl-error"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-ship-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-ship-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-ship-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ship-dl-error"
    }

  # module.order-notification-tms.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "***********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-dev" -> (known after apply)
      ~ number              = "548192617349" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-tms.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYoNac4Q=" -> (known after apply)
      ~ id      = "*****************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-tms.google_pubsub_subscription.push_subscriptions["order-notification-tms-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-tms-push"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-tms"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-dev-321910/topics/order-notification-tms-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-dev.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-tms.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-tms-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-tms-push"
    }

  # module.order-notification-tms.google_pubsub_topic_iam_member.push_topic_binding["order-notification-tms-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW9J8bIps=" -> (known after apply)
      ~ id      = "*********************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-tms-dl.google_pubsub_subscription.pull_subscriptions["order-notification-tms-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-tms-dl-error"
      + project                    = "ebo-dev-321910"
      + topic                      = "order-notification-tms-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-tms-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-tms-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-tms-dl-error"
    }

  # module.pubsub_push.google_pubsub_subscription.pull_subscriptions["invetory-threshold-push-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "invetory-threshold-push-dl-error"
      + project                    = "ebo-dev-321910"
      + topic                      = "invetory-threshold-push-dl-topic"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.pubsub_push.google_pubsub_subscription_iam_member.pull_subscription_binding["invetory-threshold-push-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "invetory-threshold-push-dl-error"
    }

Plan: 34 to add, 0 to change, 10 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #480](https://github.com/ebomart/commerce-infrastructure/actions/runs/1943908566)